frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/pevc.h
#define PEVC_SEV_SEV_Pos            0            /**< \brief (PEVC_SEV) Software Event */
#define PEVC_SEV_SEV_Msk            (_U(0xFFFFFFFF) << PEVC_SEV_SEV_Pos)
#define PEVC_SEV_SEV(value)         (PEVC_SEV_SEV_Msk & ((value) << PEVC_SEV_SEV_Pos))
#define   PEVC_SEV_SEV_0_Val              _U(0x0)   /**< \brief (PEVC_SEV) No Action */
#define   PEVC_SEV_SEV_1_Val              _U(0x1)   /**< \brief (PEVC_SEV) CPU forces software event to channel j */
#define PEVC_SEV_SEV_0              (PEVC_SEV_SEV_0_Val            << PEVC_SEV_SEV_Pos)
#define PEVC_SEV_SEV_1              (PEVC_SEV_SEV_1_Val            << PEVC_SEV_SEV_Pos)
#define PEVC_SEV_MASK               _U(0xFFFFFFFF) /**< \brief (PEVC_SEV) MASK Register */

/* -------- PEVC_BUSY : (PEVC Offset: 0x014) (R/  32) Channel / User Busy -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t BUSY:32;          /*!< bit:  0..31  Channel Status                     */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PEVC_BUSY_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PEVC_BUSY_OFFSET            0x014        /**< \brief (PEVC_BUSY offset) Channel / User Busy */
#define PEVC_BUSY_RESETVALUE        _U(0x00000000); /**< \brief (PEVC_BUSY reset_value) Channel / User Busy */

#define PEVC_BUSY_BUSY_Pos          0            /**< \brief (PEVC_BUSY) Channel Status */
#define PEVC_BUSY_BUSY_Msk          (_U(0xFFFFFFFF) << PEVC_BUSY_BUSY_Pos)
#define PEVC_BUSY_BUSY(value)       (PEVC_BUSY_BUSY_Msk & ((value) << PEVC_BUSY_BUSY_Pos))
#define   PEVC_BUSY_BUSY_0_Val            _U(0x0)   /**< \brief (PEVC_BUSY) No Action */
#define   PEVC_BUSY_BUSY_1_Val            _U(0x1)   /**< \brief (PEVC_BUSY) Channel j or User j is Busy */
#define PEVC_BUSY_BUSY_0            (PEVC_BUSY_BUSY_0_Val          << PEVC_BUSY_BUSY_Pos)
#define PEVC_BUSY_BUSY_1            (PEVC_BUSY_BUSY_1_Val          << PEVC_BUSY_BUSY_Pos)
#define PEVC_BUSY_MASK              _U(0xFFFFFFFF) /**< \brief (PEVC_BUSY) MASK Register */

/* -------- PEVC_TRIER : (PEVC Offset: 0x020) ( /W 32) Trigger Interrupt Mask Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TRIE:32;          /*!< bit:  0..31  Trigger Interrupt Enable           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PEVC_TRIER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PEVC_TRIER_OFFSET           0x020        /**< \brief (PEVC_TRIER offset) Trigger Interrupt Mask Enable Register */
#define PEVC_TRIER_RESETVALUE       _U(0x00000000); /**< \brief (PEVC_TRIER reset_value) Trigger Interrupt Mask Enable Register */

#define PEVC_TRIER_TRIE_Pos         0            /**< \brief (PEVC_TRIER) Trigger Interrupt Enable */
#define PEVC_TRIER_TRIE_Msk         (_U(0xFFFFFFFF) << PEVC_TRIER_TRIE_Pos)
#define PEVC_TRIER_TRIE(value)      (PEVC_TRIER_TRIE_Msk & ((value) << PEVC_TRIER_TRIE_Pos))
#define   PEVC_TRIER_TRIE_0_Val           _U(0x0)   /**< \brief (PEVC_TRIER) No Action */
#define   PEVC_TRIER_TRIE_1_Val           _U(0x1)   /**< \brief (PEVC_TRIER) Enable Trigger j Interrupt */
#define PEVC_TRIER_TRIE_0           (PEVC_TRIER_TRIE_0_Val         << PEVC_TRIER_TRIE_Pos)
#define PEVC_TRIER_TRIE_1           (PEVC_TRIER_TRIE_1_Val         << PEVC_TRIER_TRIE_Pos)
#define PEVC_TRIER_MASK             _U(0xFFFFFFFF) /**< \brief (PEVC_TRIER) MASK Register */

/* -------- PEVC_TRIDR : (PEVC Offset: 0x024) ( /W 32) Trigger Interrupt Mask Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TRID:32;          /*!< bit:  0..31  Trigger Interrupt Disable          */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PEVC_TRIDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PEVC_TRIDR_OFFSET           0x024        /**< \brief (PEVC_TRIDR offset) Trigger Interrupt Mask Disable Register */
#define PEVC_TRIDR_RESETVALUE       _U(0x00000000); /**< \brief (PEVC_TRIDR reset_value) Trigger Interrupt Mask Disable Register */

#define PEVC_TRIDR_TRID_Pos         0            /**< \brief (PEVC_TRIDR) Trigger Interrupt Disable */
#define PEVC_TRIDR_TRID_Msk         (_U(0xFFFFFFFF) << PEVC_TRIDR_TRID_Pos)
#define PEVC_TRIDR_TRID(value)      (PEVC_TRIDR_TRID_Msk & ((value) << PEVC_TRIDR_TRID_Pos))
#define   PEVC_TRIDR_TRID_0_Val           _U(0x0)   /**< \brief (PEVC_TRIDR) No Action */
#define   PEVC_TRIDR_TRID_1_Val           _U(0x1)   /**< \brief (PEVC_TRIDR) Disable Trigger j Interrupt */
#define PEVC_TRIDR_TRID_0           (PEVC_TRIDR_TRID_0_Val         << PEVC_TRIDR_TRID_Pos)
#define PEVC_TRIDR_TRID_1           (PEVC_TRIDR_TRID_1_Val         << PEVC_TRIDR_TRID_Pos)
#define PEVC_TRIDR_MASK             _U(0xFFFFFFFF) /**< \brief (PEVC_TRIDR) MASK Register */

/* -------- PEVC_TRIMR : (PEVC Offset: 0x028) (R/  32) Trigger Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TRIM:32;          /*!< bit:  0..31  Trigger Interrupt Mask             */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PEVC_TRIMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PEVC_TRIMR_OFFSET           0x028        /**< \brief (PEVC_TRIMR offset) Trigger Interrupt Mask Register */
#define PEVC_TRIMR_RESETVALUE       _U(0x00000000); /**< \brief (PEVC_TRIMR reset_value) Trigger Interrupt Mask Register */

#define PEVC_TRIMR_TRIM_Pos         0            /**< \brief (PEVC_TRIMR) Trigger Interrupt Mask */
#define PEVC_TRIMR_TRIM_Msk         (_U(0xFFFFFFFF) << PEVC_TRIMR_TRIM_Pos)
#define PEVC_TRIMR_TRIM(value)      (PEVC_TRIMR_TRIM_Msk & ((value) << PEVC_TRIMR_TRIM_Pos))
#define   PEVC_TRIMR_TRIM_0_Val           _U(0x0)   /**< \brief (PEVC_TRIMR) Trigger j Interrupt Disabled */
#define   PEVC_TRIMR_TRIM_1_Val           _U(0x1)   /**< \brief (PEVC_TRIMR) Trigger j Interrupt Enabled */
#define PEVC_TRIMR_TRIM_0           (PEVC_TRIMR_TRIM_0_Val         << PEVC_TRIMR_TRIM_Pos)
#define PEVC_TRIMR_TRIM_1           (PEVC_TRIMR_TRIM_1_Val         << PEVC_TRIMR_TRIM_Pos)
#define PEVC_TRIMR_MASK             _U(0xFFFFFFFF) /**< \brief (PEVC_TRIMR) MASK Register */

/* -------- PEVC_TRSR : (PEVC Offset: 0x030) (R/  32) Trigger Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TRS:32;           /*!< bit:  0..31  Trigger Interrupt Status           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PEVC_TRSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PEVC_TRSR_OFFSET            0x030        /**< \brief (PEVC_TRSR offset) Trigger Status Register */
#define PEVC_TRSR_RESETVALUE        _U(0x00000000); /**< \brief (PEVC_TRSR reset_value) Trigger Status Register */

