frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/pevc.h
#define PEVC_OVSCR_OFFSET           0x054        /**< \brief (PEVC_OVSCR offset) Overrun Status Clear Register */
#define PEVC_OVSCR_RESETVALUE       _U(0x00000000); /**< \brief (PEVC_OVSCR reset_value) Overrun Status Clear Register */

#define PEVC_OVSCR_OVSC_Pos         0            /**< \brief (PEVC_OVSCR) Overrun Interrupt Status Clear */
#define PEVC_OVSCR_OVSC_Msk         (_U(0xFFFFFFFF) << PEVC_OVSCR_OVSC_Pos)
#define PEVC_OVSCR_OVSC(value)      (PEVC_OVSCR_OVSC_Msk & ((value) << PEVC_OVSCR_OVSC_Pos))
#define   PEVC_OVSCR_OVSC_0_Val           _U(0x0)   /**< \brief (PEVC_OVSCR) No Action */
#define   PEVC_OVSCR_OVSC_1_Val           _U(0x1)   /**< \brief (PEVC_OVSCR) Clear Overrun Status Bit j */
#define PEVC_OVSCR_OVSC_0           (PEVC_OVSCR_OVSC_0_Val         << PEVC_OVSCR_OVSC_Pos)
#define PEVC_OVSCR_OVSC_1           (PEVC_OVSCR_OVSC_1_Val         << PEVC_OVSCR_OVSC_Pos)
#define PEVC_OVSCR_MASK             _U(0xFFFFFFFF) /**< \brief (PEVC_OVSCR) MASK Register */

/* -------- PEVC_CHMX : (PEVC Offset: 0x100) (R/W 32) CHMX Channel Multiplexer -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EVMX:6;           /*!< bit:  0.. 5  Event Multiplexer                  */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t SMX:1;            /*!< bit:      8  Software Event Multiplexer         */
    uint32_t :23;              /*!< bit:  9..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PEVC_CHMX_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PEVC_CHMX_OFFSET            0x100        /**< \brief (PEVC_CHMX offset) Channel Multiplexer */
#define PEVC_CHMX_RESETVALUE        _U(0x00000000); /**< \brief (PEVC_CHMX reset_value) Channel Multiplexer */

#define PEVC_CHMX_EVMX_Pos          0            /**< \brief (PEVC_CHMX) Event Multiplexer */
#define PEVC_CHMX_EVMX_Msk          (_U(0x3F) << PEVC_CHMX_EVMX_Pos)
#define PEVC_CHMX_EVMX(value)       (PEVC_CHMX_EVMX_Msk & ((value) << PEVC_CHMX_EVMX_Pos))
#define   PEVC_CHMX_EVMX_0_Val            _U(0x0)   /**< \brief (PEVC_CHMX) Event 0 */
#define   PEVC_CHMX_EVMX_1_Val            _U(0x1)   /**< \brief (PEVC_CHMX) Event 1 */
#define PEVC_CHMX_EVMX_0            (PEVC_CHMX_EVMX_0_Val          << PEVC_CHMX_EVMX_Pos)
#define PEVC_CHMX_EVMX_1            (PEVC_CHMX_EVMX_1_Val          << PEVC_CHMX_EVMX_Pos)
#define PEVC_CHMX_SMX_Pos           8            /**< \brief (PEVC_CHMX) Software Event Multiplexer */
#define PEVC_CHMX_SMX               (_U(0x1) << PEVC_CHMX_SMX_Pos)
#define   PEVC_CHMX_SMX_0_Val             _U(0x0)   /**< \brief (PEVC_CHMX) Hardware events */
#define   PEVC_CHMX_SMX_1_Val             _U(0x1)   /**< \brief (PEVC_CHMX) Software event */
#define PEVC_CHMX_SMX_0             (PEVC_CHMX_SMX_0_Val           << PEVC_CHMX_SMX_Pos)
#define PEVC_CHMX_SMX_1             (PEVC_CHMX_SMX_1_Val           << PEVC_CHMX_SMX_Pos)
#define PEVC_CHMX_MASK              _U(0x0000013F) /**< \brief (PEVC_CHMX) MASK Register */

/* -------- PEVC_EVS : (PEVC Offset: 0x200) (R/W 32) EVS Event Shaper -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EN:1;             /*!< bit:      0  Event Shaper Enable                */
    uint32_t :15;              /*!< bit:  1..15  Reserved                           */
    uint32_t IGFR:1;           /*!< bit:     16  Input Glitch Filter Rise           */
    uint32_t IGFF:1;           /*!< bit:     17  Input Glitch Filter Fall           */
    uint32_t IGFON:1;          /*!< bit:     18  Input Glitch Filter Status         */
    uint32_t :13;              /*!< bit: 19..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PEVC_EVS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PEVC_EVS_OFFSET             0x200        /**< \brief (PEVC_EVS offset) Event Shaper */
#define PEVC_EVS_RESETVALUE         _U(0x00000000); /**< \brief (PEVC_EVS reset_value) Event Shaper */

#define PEVC_EVS_EN_Pos             0            /**< \brief (PEVC_EVS) Event Shaper Enable */
#define PEVC_EVS_EN                 (_U(0x1) << PEVC_EVS_EN_Pos)
#define   PEVC_EVS_EN_0_Val               _U(0x0)   /**< \brief (PEVC_EVS) No Action */
#define   PEVC_EVS_EN_1_Val               _U(0x1)   /**< \brief (PEVC_EVS) Event Shaper enable */
#define PEVC_EVS_EN_0               (PEVC_EVS_EN_0_Val             << PEVC_EVS_EN_Pos)
#define PEVC_EVS_EN_1               (PEVC_EVS_EN_1_Val             << PEVC_EVS_EN_Pos)
#define PEVC_EVS_IGFR_Pos           16           /**< \brief (PEVC_EVS) Input Glitch Filter Rise */
#define PEVC_EVS_IGFR               (_U(0x1) << PEVC_EVS_IGFR_Pos)
#define   PEVC_EVS_IGFR_0_Val             _U(0x0)   /**< \brief (PEVC_EVS) No Action */
#define   PEVC_EVS_IGFR_1_Val             _U(0x1)   /**< \brief (PEVC_EVS) Input Glitch Filter : a rising edge on event input will raise trigger output */
#define PEVC_EVS_IGFR_0             (PEVC_EVS_IGFR_0_Val           << PEVC_EVS_IGFR_Pos)
#define PEVC_EVS_IGFR_1             (PEVC_EVS_IGFR_1_Val           << PEVC_EVS_IGFR_Pos)
#define PEVC_EVS_IGFF_Pos           17           /**< \brief (PEVC_EVS) Input Glitch Filter Fall */
#define PEVC_EVS_IGFF               (_U(0x1) << PEVC_EVS_IGFF_Pos)
#define   PEVC_EVS_IGFF_0_Val             _U(0x0)   /**< \brief (PEVC_EVS) No Action */
#define   PEVC_EVS_IGFF_1_Val             _U(0x1)   /**< \brief (PEVC_EVS) Input Glitch Filter : a falling edge on event input will raise trigger output */
#define PEVC_EVS_IGFF_0             (PEVC_EVS_IGFF_0_Val           << PEVC_EVS_IGFF_Pos)
#define PEVC_EVS_IGFF_1             (PEVC_EVS_IGFF_1_Val           << PEVC_EVS_IGFF_Pos)
#define PEVC_EVS_IGFON_Pos          18           /**< \brief (PEVC_EVS) Input Glitch Filter Status */
#define PEVC_EVS_IGFON              (_U(0x1) << PEVC_EVS_IGFON_Pos)
#define PEVC_EVS_MASK               _U(0x00070001) /**< \brief (PEVC_EVS) MASK Register */

/* -------- PEVC_IGFDR : (PEVC Offset: 0x300) (R/W 32) Input Glitch Filter Divider Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t IGFDR:4;          /*!< bit:  0.. 3  Input Glitch Filter Divider Register */
    uint32_t :28;              /*!< bit:  4..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PEVC_IGFDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PEVC_IGFDR_OFFSET           0x300        /**< \brief (PEVC_IGFDR offset) Input Glitch Filter Divider Register */
#define PEVC_IGFDR_RESETVALUE       _U(0x00000000); /**< \brief (PEVC_IGFDR reset_value) Input Glitch Filter Divider Register */

#define PEVC_IGFDR_IGFDR_Pos        0            /**< \brief (PEVC_IGFDR) Input Glitch Filter Divider Register */
#define PEVC_IGFDR_IGFDR_Msk        (_U(0xF) << PEVC_IGFDR_IGFDR_Pos)
#define PEVC_IGFDR_IGFDR(value)     (PEVC_IGFDR_IGFDR_Msk & ((value) << PEVC_IGFDR_IGFDR_Pos))
#define PEVC_IGFDR_MASK             _U(0x0000000F) /**< \brief (PEVC_IGFDR) MASK Register */

/* -------- PEVC_PARAMETER : (PEVC Offset: 0x3F8) (R/  32) Parameter -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t IGF_COUNT:8;      /*!< bit:  0.. 7  Number of Input Glitch Filters     */
    uint32_t EVS_COUNT:8;      /*!< bit:  8..15  Number of Event Shapers            */
    uint32_t EVIN:8;           /*!< bit: 16..23  Number of Event Inputs / Generators */
    uint32_t TRIGOUT:8;        /*!< bit: 24..31  Number of Trigger Outputs / Channels / Users */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PEVC_PARAMETER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

