frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/pevc.h
#define PEVC_PARAMETER_OFFSET       0x3F8        /**< \brief (PEVC_PARAMETER offset) Parameter */
#define PEVC_PARAMETER_RESETVALUE   _U(0x14061824); /**< \brief (PEVC_PARAMETER reset_value) Parameter */

#define PEVC_PARAMETER_IGF_COUNT_Pos 0            /**< \brief (PEVC_PARAMETER) Number of Input Glitch Filters */
#define PEVC_PARAMETER_IGF_COUNT_Msk (_U(0xFF) << PEVC_PARAMETER_IGF_COUNT_Pos)
#define PEVC_PARAMETER_IGF_COUNT(value) (PEVC_PARAMETER_IGF_COUNT_Msk & ((value) << PEVC_PARAMETER_IGF_COUNT_Pos))
#define PEVC_PARAMETER_EVS_COUNT_Pos 8            /**< \brief (PEVC_PARAMETER) Number of Event Shapers */
#define PEVC_PARAMETER_EVS_COUNT_Msk (_U(0xFF) << PEVC_PARAMETER_EVS_COUNT_Pos)
#define PEVC_PARAMETER_EVS_COUNT(value) (PEVC_PARAMETER_EVS_COUNT_Msk & ((value) << PEVC_PARAMETER_EVS_COUNT_Pos))
#define PEVC_PARAMETER_EVIN_Pos     16           /**< \brief (PEVC_PARAMETER) Number of Event Inputs / Generators */
#define PEVC_PARAMETER_EVIN_Msk     (_U(0xFF) << PEVC_PARAMETER_EVIN_Pos)
#define PEVC_PARAMETER_EVIN(value)  (PEVC_PARAMETER_EVIN_Msk & ((value) << PEVC_PARAMETER_EVIN_Pos))
#define PEVC_PARAMETER_TRIGOUT_Pos  24           /**< \brief (PEVC_PARAMETER) Number of Trigger Outputs / Channels / Users */
#define PEVC_PARAMETER_TRIGOUT_Msk  (_U(0xFF) << PEVC_PARAMETER_TRIGOUT_Pos)
#define PEVC_PARAMETER_TRIGOUT(value) (PEVC_PARAMETER_TRIGOUT_Msk & ((value) << PEVC_PARAMETER_TRIGOUT_Pos))
#define PEVC_PARAMETER_MASK         _U(0xFFFFFFFF) /**< \brief (PEVC_PARAMETER) MASK Register */

/* -------- PEVC_VERSION : (PEVC Offset: 0x3FC) (R/  32) Version -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version Number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Variant Number                     */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PEVC_VERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PEVC_VERSION_OFFSET         0x3FC        /**< \brief (PEVC_VERSION offset) Version */
#define PEVC_VERSION_RESETVALUE     _U(0x00000200); /**< \brief (PEVC_VERSION reset_value) Version */

#define PEVC_VERSION_VERSION_Pos    0            /**< \brief (PEVC_VERSION) Version Number */
#define PEVC_VERSION_VERSION_Msk    (_U(0xFFF) << PEVC_VERSION_VERSION_Pos)
#define PEVC_VERSION_VERSION(value) (PEVC_VERSION_VERSION_Msk & ((value) << PEVC_VERSION_VERSION_Pos))
#define PEVC_VERSION_VARIANT_Pos    16           /**< \brief (PEVC_VERSION) Variant Number */
#define PEVC_VERSION_VARIANT_Msk    (_U(0xF) << PEVC_VERSION_VARIANT_Pos)
#define PEVC_VERSION_VARIANT(value) (PEVC_VERSION_VARIANT_Msk & ((value) << PEVC_VERSION_VARIANT_Pos))
#define PEVC_VERSION_MASK           _U(0x000F0FFF) /**< \brief (PEVC_VERSION) MASK Register */

/** \brief PevcChmx hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO PEVC_CHMX_Type            CHMX;        /**< \brief Offset: 0x000 (R/W 32) Channel Multiplexer */
 } bf;
 struct {
  RwReg   PEVC_CHMX;          /**< \brief (PEVC Offset: 0x000) Channel Multiplexer */
 } reg;
} PevcChmx;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief PevcEvs hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO PEVC_EVS_Type             EVS;         /**< \brief Offset: 0x000 (R/W 32) Event Shaper */
 } bf;
 struct {
  RwReg   PEVC_EVS;           /**< \brief (PEVC Offset: 0x000) Event Shaper */
 } reg;
} PevcEvs;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief PEVC hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __I  PEVC_CHSR_Type            CHSR;        /**< \brief Offset: 0x000 (R/  32) Channel Status Register */
  __O  PEVC_CHER_Type            CHER;        /**< \brief Offset: 0x004 ( /W 32) Channel Enable Register */
  __O  PEVC_CHDR_Type            CHDR;        /**< \brief Offset: 0x008 ( /W 32) Channel Disable Register */
       RoReg8                    Reserved1[0x4];
  __O  PEVC_SEV_Type             SEV;         /**< \brief Offset: 0x010 ( /W 32) Software Event */
  __I  PEVC_BUSY_Type            BUSY;        /**< \brief Offset: 0x014 (R/  32) Channel / User Busy */
       RoReg8                    Reserved2[0x8];
  __O  PEVC_TRIER_Type           TRIER;       /**< \brief Offset: 0x020 ( /W 32) Trigger Interrupt Mask Enable Register */
  __O  PEVC_TRIDR_Type           TRIDR;       /**< \brief Offset: 0x024 ( /W 32) Trigger Interrupt Mask Disable Register */
  __I  PEVC_TRIMR_Type           TRIMR;       /**< \brief Offset: 0x028 (R/  32) Trigger Interrupt Mask Register */
       RoReg8                    Reserved3[0x4];
  __I  PEVC_TRSR_Type            TRSR;        /**< \brief Offset: 0x030 (R/  32) Trigger Status Register */
  __O  PEVC_TRSCR_Type           TRSCR;       /**< \brief Offset: 0x034 ( /W 32) Trigger Status Clear Register */
       RoReg8                    Reserved4[0x8];
  __O  PEVC_OVIER_Type           OVIER;       /**< \brief Offset: 0x040 ( /W 32) Overrun Interrupt Mask Enable Register */
  __O  PEVC_OVIDR_Type           OVIDR;       /**< \brief Offset: 0x044 ( /W 32) Overrun Interrupt Mask Disable Register */
  __I  PEVC_OVIMR_Type           OVIMR;       /**< \brief Offset: 0x048 (R/  32) Overrun Interrupt Mask Register */
       RoReg8                    Reserved5[0x4];
  __I  PEVC_OVSR_Type            OVSR;        /**< \brief Offset: 0x050 (R/  32) Overrun Status Register */
  __O  PEVC_OVSCR_Type           OVSCR;       /**< \brief Offset: 0x054 ( /W 32) Overrun Status Clear Register */
       RoReg8                    Reserved6[0xA8];
       PevcChmx                  Chmx[19];    /**< \brief Offset: 0x100 PevcChmx groups [TRIGOUT_BITS] */
       RoReg8                    Reserved7[0xB4];
       PevcEvs                   Evs[31];     /**< \brief Offset: 0x200 PevcEvs groups [EVIN_BITS] */
       RoReg8                    Reserved8[0x84];
  __IO PEVC_IGFDR_Type           IGFDR;       /**< \brief Offset: 0x300 (R/W 32) Input Glitch Filter Divider Register */
       RoReg8                    Reserved9[0xF4];
  __I  PEVC_PARAMETER_Type       PARAMETER;   /**< \brief Offset: 0x3F8 (R/  32) Parameter */
  __I  PEVC_VERSION_Type         VERSION;     /**< \brief Offset: 0x3FC (R/  32) Version */
 } bf;
 struct {
  RoReg   PEVC_CHSR;          /**< \brief (PEVC Offset: 0x000) Channel Status Register */
  WoReg   PEVC_CHER;          /**< \brief (PEVC Offset: 0x004) Channel Enable Register */
  WoReg   PEVC_CHDR;          /**< \brief (PEVC Offset: 0x008) Channel Disable Register */
  RoReg8  Reserved10[0x4];
  WoReg   PEVC_SEV;           /**< \brief (PEVC Offset: 0x010) Software Event */
  RoReg   PEVC_BUSY;          /**< \brief (PEVC Offset: 0x014) Channel / User Busy */
  RoReg8  Reserved11[0x8];
  WoReg   PEVC_TRIER;         /**< \brief (PEVC Offset: 0x020) Trigger Interrupt Mask Enable Register */
  WoReg   PEVC_TRIDR;         /**< \brief (PEVC Offset: 0x024) Trigger Interrupt Mask Disable Register */
  RoReg   PEVC_TRIMR;         /**< \brief (PEVC Offset: 0x028) Trigger Interrupt Mask Register */
  RoReg8  Reserved12[0x4];
  RoReg   PEVC_TRSR;          /**< \brief (PEVC Offset: 0x030) Trigger Status Register */
  WoReg   PEVC_TRSCR;         /**< \brief (PEVC Offset: 0x034) Trigger Status Clear Register */
  RoReg8  Reserved13[0x8];
  WoReg   PEVC_OVIER;         /**< \brief (PEVC Offset: 0x040) Overrun Interrupt Mask Enable Register */
  WoReg   PEVC_OVIDR;         /**< \brief (PEVC Offset: 0x044) Overrun Interrupt Mask Disable Register */
  RoReg   PEVC_OVIMR;         /**< \brief (PEVC Offset: 0x048) Overrun Interrupt Mask Register */
  RoReg8  Reserved14[0x4];
  RoReg   PEVC_OVSR;          /**< \brief (PEVC Offset: 0x050) Overrun Status Register */
  WoReg   PEVC_OVSCR;         /**< \brief (PEVC Offset: 0x054) Overrun Status Clear Register */
  RoReg8  Reserved15[0xA8];
  PevcChmx PEVC_CHMX[19];      /**< \brief (PEVC Offset: 0x100) PevcChmx groups [TRIGOUT_BITS] */
  RoReg8  Reserved16[0xB4];
  PevcEvs PEVC_EVS[31];       /**< \brief (PEVC Offset: 0x200) PevcEvs groups [EVIN_BITS] */
  RoReg8  Reserved17[0x84];
  RwReg   PEVC_IGFDR;         /**< \brief (PEVC Offset: 0x300) Input Glitch Filter Divider Register */
  RoReg8  Reserved18[0xF4];
  RoReg   PEVC_PARAMETER;     /**< \brief (PEVC Offset: 0x3F8) Parameter */
  RoReg   PEVC_VERSION;       /**< \brief (PEVC Offset: 0x3FC) Version */
 } reg;
} Pevc;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_PEVC_COMPONENT_ */
